
[GraphicalObject]
Name=EEVtool
Path=
PosStyle=VARIABLE
RC-DLL=hpcor008.dll
Caption=積分イベント変更
x=0
y=0
Height=70
Width=265

[ToolDescriptor]
1=Check1Text, STATIC , HPGWCT02.DLL
2=Check1, IMAGESET , hpgbut02.DLL
3=Btn1 , PUSHBUTTON , hpgbut02.dll
4=Btn2 , PUSHBUTTON , hpgbut02.dll
5=Btn3 , PUSHBUTTON , hpgbut02.dll
6=Btn4 , PUSHBUTTON , hpgbut02.dll
7=Btn5 , PUSHBUTTON , hpgbut02.dll
8=Btn6 , PUSHBUTTON , hpgbut02.dll
9=Btn7 , PUSHBUTTON , hpgbut02.dll
10=Btn8 , PUSHBUTTON , hpgbut02.dll

[STATIC Check1Text]
Text1=メソッド マニュアル イベント
x=5
y=50
Height=15
Width=150
BKColor=192,192,192
Font=ＭＳ Ｐゴシック,9,normal
Enable=1
Help=マニュアル イベントを適用してシグナルを積分

[STATIC Check3Text]
Text1=拡張ベースライン
x=5
y=53
Height=15
Width=150
BKColor=192,192,192
Font=ＭＳ Ｐゴシック,9,normal
Enable=1
Help=拡張ベースライン モード選択

[IMAGESET Check1]
Set0=RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|EEV_ToolOnControl 1|マニュアル イベント ON|
Set1=RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|EEV_ToolOnControl 1|マニュアル イベント OFF|
x=161
y=49
width=13
height=13
FrameThickness=0
Color=192,192,192
Enable=1
State=0
SetIndex=0

[IMAGESET Check3]
Set0=RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|RBMP.CHECKBOX_UNCHECKED|EEV_ToolOnControl 11|拡張ベースライン モード ON|
Set1=RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|RBMP.CHECKBOX_CHECKED|EEV_ToolOnControl 11|拡張ベースライン モード OFF|
x=161
y=52
width=13
height=13
FrameThickness=0
Color=192,192,192
Enable=1
State=0
SetIndex=0

[NONEDITCOMBOBOX Check2]
DefCommand=EEV_ToolOnControl 2,
x=136
y=66
width=125
height=120
Enable=1
BkColor=255,255,255
Font=ＭＳ Ｐゴシック,9,normal

[PushButton Btn1]
Command=EEV_ToolOnControl 4
ImageList=RBMP.EDITEVENTSSAVE20|RBMP.EDITEVENTSSAVE20|RBMP.EDITEVENTSSAVE_DISABLE20|
Help=積分イベントを保存して終了します
x=5
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold

[PushButton Btn2]
Command=EEV_ToolOnControl 7
ImageList=RBMP.EDITEVENTSEDITTAB20|RBMP.EDITEVENTSEDITTAB20|RBMP.EDITEVENTSEDITTAB_DISABLE20|
Help=使用できる積分イベントを表示します
x=31
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold
Enable=1

[PushButton Btn3]
Command=EEV_ToolOnControl 5
ImageList=RBMP.EDITEVENTSCOPYTAB20|RBMP.EDITEVENTSCOPYTAB20|RBMP.EDITEVENTSCOPYTAB_DISABLE20|
Help=イベントからイベント テーブルをコピーし、現在のテーブルを入れ替えます
x=57
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold

[PushButton Btn4]
Command=EEV_ToolOnControl 8
ImageList=RBMP.EDITEVENTSINSROW20|RBMP.EDITEVENTSINSROW20|RBMP.EDITEVENTSINSROW_DISABLE20|
Help=積分イベント テーブルへ新しい行を追加します
x=83
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold

[PushButton Btn5]
Command=EEV_ToolOnControl 9
ImageList=RBMP.EDITEVENTSDELROW20|RBMP.EDITEVENTSDELROW20|RBMP.EDITEVENTSDELROW_DISABLE20|
Help=積分イベント テーブルから選択行を削除します
x=109
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold

[PushButton Btn6]
Command=EEV_ToolOnControl 6
ImageList=RBMP.EDITEVENTSSIGNALTAB20|RBMP.EDITEVENTSSIGNALTAB20|RBMP.EDITEVENTSSIGNALTAB_DISABLE20|
Help=シグナルとシグナルの積分に使われる積分イベント テーブルを表示します
x=135
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold

[PushButton Btn7]
Command=EEV_ToolOnControl 3
ImageList=RBMP.EDITEVENTSEXIT20|RBMP.EDITEVENTSEXIT20|RBMP.EDITEVENTSEXIT_DISABLE20|
Help=積分イベントの変更をキャンセルします
x=161
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold

[PushButton Btn8]
Command=EEV_ToolOnControl 10
ImageList=RBMP.EDITEVENTSHELP20|RBMP.EDITEVENTSHELP20|RBMP.EDITEVENTSHELP_DISABLE20|
Help=ヘルプを表示します
x=187
y=5
width=26
height=26
Font=ＭＳ Ｐゴシック,9,bold
